In [8]:
# 로컬 DB와 SSMS 연결
import pyodbc 

conn = pyodbc.connect('Driver={SQL Server};'
                      'Server=DESKTOP-NBIHLGQ;'
                      'Database=TESTDB3;'
                      'Trusted_Connection=yes;')

with conn.cursor() as cursor:
    cursor.execute("select * from dbo.productTb")
    row = cursor.fetchall()
    print(row)

[('GD101     ', '나이키', '2000-12-12', '미국', Decimal('900.0000'), 1), ('GD102     ', '아디다스', '2000-01-12', '독일', Decimal('450.0000'), 2), ('GD103     ', '프로스펙스', '2000-02-12', '한국', Decimal('720.0000'), 3), ('GD104     ', 'FILA', '2000-03-15', '영국', Decimal('500.0000'), 4)]

In [2]:
# 테스트용 DataFrame 작성(100만개 행, 4개 컬럼)
import random
import pandas as pd
df_01 = pd.DataFrame({'id' : [i for i in range(1000000)], 
                      'c1' : [random.randrange(-10000, 10000) for _ in range(1000000)], 
                      'c2' : [random.randrange(-10000, 10000) for _ in range(1000000)], 
                      'c3' : [random.randrange(-10000, 10000) for _ in range(1000000)]})

df_02 = pd.DataFrame({'id' : [i for i in range(1000000)], 
                      'c1' : [random.randrange(-10000, 10000) for _ in range(1000000)], 
                      'c2' : [random.randrange(-10000, 10000) for _ in range(1000000)], 
                      'c3' : [random.randrange(-10000, 10000) for _ in range(1000000)]})
df_02

            id    c1    c2    c3
0            0  6261 -4140  6537
1            1 -7834  3008 -6573
2            2  7840  3606  9865
3            3  5462 -6383 -5336
4            4 -3061 -2475 -9911
...        ...   ...   ...   ...
999995  999995 -5936  5124  7102
999996  999996   659 -9081 -1857
999997  999997  9317 -3466  5960
999998  999998  3203  6243 -4243
999999  999999 -2217 -1551  5167

[1000000 rows x 4 columns]

In [3]:
# 데이터 적재
import pyodbc 
from tqdm.notebook import tqdm

conn = pyodbc.connect('Driver={SQL Server};'
                      'Server=DESKTOP-NBIHLGQ;'
                      'Database=TESTDB3;'
                      'Trusted_Connection=yes;')
cursor = conn.cursor()
for index, row in tqdm(df_01.iterrows()):
     cursor.execute("INSERT INTO dbo.test01(id,c1,c2,c3) values(?,?,?,?)", 
                     int(row.id), int(row.c1), int(row.c2), int(row.c3))

for index, row in tqdm(df_02.iterrows()):
     cursor.execute("INSERT INTO dbo.test02(id,c1,c2,c3) values(?,?,?,?)", 
                     int(row.id), int(row.c1), int(row.c2), int(row.c3))
conn.commit()
cursor.close()

0it [00:00, ?it/s]

0it [00:00, ?it/s]